Rails/breakdown3.0/app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "asdfasdf"], ["deadline", "2017-12-03"], ["created_at", "2017-12-03 23:44:54.476992"], ["updated_at", "2017-12-03 23:44:54.476992"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "name" = ?, "deadline" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Recruit Participants"], ["deadline", "2017-12-09"], ["updated_at", "2017-12-04 04:59:38.985475"], ["id", 5]]